tap "homebrew/bundle"
tap "homebrew/services"
tap "smudge/smudge"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Console Matrix
brew "cmatrix"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Apache HTTP server
brew "httpd"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Python version management
brew "pyenv"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# A CLI for configuring 'Night Shift' on macOS 🌕🌖🌗🌘🌑
brew "smudge/smudge/nightlight"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Batch file renaming utility
cask "advanced-renamer"
# Enable Windows-like alt-tab
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Desktop password and login vault
cask "bitwarden"
# Remove junk and unused files
cask "ccleaner"
# Image, video and clipboard optimiser
cask "clop"
# Write, edit, and chat about your code with AI
cask "cursor"
# Photography workflow application and raw developer
cask "darktable"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-open-sans"
cask "font-roboto"
# GIT client
cask "fork"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source keystroke visualiser
cask "keycastr"
# Utility that shows the latest app updates
cask "latest"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# French TV streaming service
cask "molotov"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Emoji picker optimised for blind people
cask "rocket"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Interior design application
cask "sweet-home3d"
# Sync and backup service to Synology NAS drives
cask "synology-drive"
# AI image upscaler
cask "upscayl"
# Multimedia player
cask "vlc"
# Resources for Wacom tablets
cask "wacom-tablet"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
mas "Bitwarden", id: 1352778147
mas "HP", id: 1474276998
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MenubarX", id: 1575588022
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
vscode "ms-vscode.sublime-keybindings"
